In [1]:
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]

In [2]:

List = zip(names,grades,bsdegrees,msdegrees,phddegrees)
df = pd.DataFrame(data=List,
        columns=['Names','Grades','BS','MS','PHD'])
df

     Names  Grades  BS  MS  PHD
0      Bob      76   1   2    0
1  Jessica      95   1   1    1
2     Mary      77   0   0    0
3     John      78   0   0    0
4      Mel      99   1   0    0

In [3]:
df.count() # number of values

Names     5
Grades    5
BS        5
MS        5
PHD       5
dtype: int64

In [4]:

df.mean() # arithmetic average

Grades    85.0
BS         0.6
MS         0.6
PHD        0.2
dtype: float64

In [5]:
df.std() # standard deviation

Grades    11.067972
BS         0.547723
MS         0.894427
PHD        0.447214
dtype: float64

In [6]:
df.min() # minimum

Names     Bob
Grades     76
BS          0
MS          0
PHD         0
dtype: object

In [7]:

df.max() # maximum

Names     Mel
Grades     99
BS          1
MS          2
PHD         1
dtype: object

In [8]:
df.quantile(.25) # first quartile

Grades    77.0
BS         0.0
MS         0.0
PHD        0.0
Name: 0.25, dtype: float64

In [9]:
df.quantile(.5) # second quartile

Grades    78.0
BS         1.0
MS         0.0
PHD        0.0
Name: 0.5, dtype: float64

In [10]:
df.quantile(.75) # third quartile

Grades    95.0
BS         1.0
MS         1.0
PHD        0.0
Name: 0.75, dtype: float64

In [11]:
df.mean()

Grades    85.0
BS         0.6
MS         0.6
PHD        0.2
dtype: float64

In [12]:
df.median()

Grades    78.0
BS         1.0
MS         0.0
PHD        0.0
dtype: float64

In [13]:
df.mode()

     Names  Grades   BS   MS  PHD
0      Bob      76  1.0  0.0  0.0
1  Jessica      77  NaN  NaN  NaN
2     John      78  NaN  NaN  NaN
3     Mary      95  NaN  NaN  NaN
4      Mel      99  NaN  NaN  NaN

In [14]:
df.var()

Grades    122.5
BS          0.3
MS          0.8
PHD         0.2
dtype: float64